TexasInstruments/mcupsdk-core/test/drivers/tester/am263x-cc/r5fss0-0_freertos/example.syscfg
section1.load_memory                  = "R5F_VECS";
section1.group                        = false;
section1.$name                        = "Vector Table";
section1.output_section.create(1);
section1.output_section[0].$name      = ".vectors";
section1.output_section[0].palignment = true;

section2.load_memory                  = "OCRAM";
section2.$name                        = "Text Segments";
section2.output_section.create(5);
section2.output_section[0].$name      = ".text.hwi";
section2.output_section[0].palignment = true;
section2.output_section[1].$name      = ".text.cache";
section2.output_section[1].palignment = true;
section2.output_section[2].$name      = ".text.mpu";
section2.output_section[2].palignment = true;
section2.output_section[3].$name      = ".text.boot";
section2.output_section[3].palignment = true;
section2.output_section[4].$name      = ".text:abort";
section2.output_section[4].palignment = true;

section3.load_memory                  = "OCRAM";
section3.$name                        = "Code and Read-Only Data";
section3.output_section.create(2);
section3.output_section[0].$name      = ".text";
section3.output_section[0].palignment = true;
section3.output_section[1].$name      = ".rodata";
section3.output_section[1].palignment = true;

section4.load_memory                  = "OCRAM";
section4.$name                        = "Data Segment";
section4.output_section.create(1);
section4.output_section[0].$name      = ".data";
section4.output_section[0].palignment = true;

section5.load_memory                             = "OCRAM";
section5.$name                                   = "Memory Segments";
section5.output_section.create(3);
section5.output_section[0].$name                 = ".bss";
section5.output_section[0].output_sections_start = "__BSS_START";
section5.output_section[0].output_sections_end   = "__BSS_END";
section5.output_section[0].palignment            = true;
section5.output_section[1].$name                 = ".sysmem";
section5.output_section[1].palignment            = true;
section5.output_section[2].$name                 = ".stack";
section5.output_section[2].palignment            = true;

section6.load_memory                              = "OCRAM";
section6.$name                                    = "Stack Segments";
section6.output_section.create(5);
section6.output_section[0].$name                  = ".irqstack";
section6.output_section[0].output_sections_start  = "__IRQ_STACK_START";
section6.output_section[0].output_sections_end    = "__IRQ_STACK_END";
section6.output_section[0].input_section.create(1);
section6.output_section[0].input_section[0].$name = ". = . + __IRQ_STACK_SIZE;";
section6.output_section[1].$name                  = ".fiqstack";
section6.output_section[1].output_sections_start  = "__FIQ_STACK_START";
section6.output_section[1].output_sections_end    = "__FIQ_STACK_END";
section6.output_section[1].input_section.create(1);
section6.output_section[1].input_section[0].$name = ". = . + __FIQ_STACK_SIZE;";
section6.output_section[2].$name                  = ".svcstack";
section6.output_section[2].output_sections_start  = "__SVC_STACK_START";
section6.output_section[2].output_sections_end    = "__SVC_STACK_END";
section6.output_section[2].input_section.create(1);
section6.output_section[2].input_section[0].$name = ". = . + __SVC_STACK_SIZE;";
section6.output_section[3].$name                  = ".abortstack";
section6.output_section[3].output_sections_start  = "__ABORT_STACK_START";
section6.output_section[3].output_sections_end    = "__ABORT_STACK_END";
section6.output_section[3].input_section.create(1);
section6.output_section[3].input_section[0].$name = ". = . + __ABORT_STACK_SIZE;";
section6.output_section[4].$name                  = ".undefinedstack";
section6.output_section[4].output_sections_start  = "__UNDEFINED_STACK_START";
section6.output_section[4].output_sections_end    = "__UNDEFINED_STACK_END";
section6.output_section[4].input_section.create(1);
section6.output_section[4].input_section[0].$name = ". = . + __UNDEFINED_STACK_SIZE;";

section7.load_memory                  = "OCRAM";
section7.$name                        = "Initialization and Exception Handling";
section7.output_section.create(3);
section7.output_section[0].$name      = ".ARM.exidx";
section7.output_section[0].palignment = true;
section7.output_section[1].$name      = ".init_array";
section7.output_section[1].palignment = true;
section7.output_section[2].$name      = ".fini_array";
section7.output_section[2].palignment = true;

section8.load_memory                 = "USER_SHM_MEM";
section8.type                        = "NOLOAD";
section8.$name                       = "User Shared Memory";
section8.group                       = false;
section8.output_section.create(1);
section8.output_section[0].$name     = ".bss.user_shared_mem";
section8.output_section[0].alignment = 0;

section9.load_memory                 = "LOG_SHM_MEM";
section9.$name                       = "Log Shared Memory";
section9.group                       = false;
section9.type                        = "NOLOAD";
section9.output_section.create(1);
section9.output_section[0].$name     = ".bss.log_shared_mem";
section9.output_section[0].alignment = 0;

section10.load_memory                 = "RTOS_NORTOS_IPC_SHM_MEM";
section10.type                        = "NOLOAD";
section10.$name                       = "IPC Shared Memory";
section10.group                       = false;
section10.output_section.create(1);
section10.output_section[0].$name     = ".bss.ipc_vring_mem";
section10.output_section[0].alignment = 0;

section11.load_memory                 = "MAILBOX_HSM";
section11.type                        = "NOLOAD";
section11.$name                       = "SIPC HSM Queue Memory";
section11.group                       = false;
section11.output_section.create(1);
section11.output_section[0].$name     = ".bss.sipc_hsm_queue_mem";
section11.output_section[0].alignment = 0;

section12.load_memory                 = "MAILBOX_R5F";
section12.$name                       = "SIPC R5F Queue Memory";
section12.group                       = false;
section12.type                        = "NOLOAD";
section12.output_section.create(1);
section12.output_section[0].$name     = ".bss.sipc_r5f_queue_mem";
section12.output_section[0].alignment = 0;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
gpio1.GPIO.$suggestSolution             = "GPIO0";
gpio2.GPIO.$suggestSolution             = "GPIO0";
gpio3.GPIO.$suggestSolution             = "GPIO0";
gpio4.GPIO.$suggestSolution             = "GPIO0";
gpio5.GPIO.$suggestSolution             = "GPIO0";
gpio6.GPIO.$suggestSolution             = "GPIO0";
gpio7.GPIO.$suggestSolution             = "GPIO0";
gpio8.GPIO.$suggestSolution             = "GPIO0";
gpio9.GPIO.$suggestSolution             = "GPIO0";
gpio10.GPIO.$suggestSolution            = "GPIO0";
gpio11.GPIO.$suggestSolution            = "GPIO0";
gpio12.GPIO.$suggestSolution            = "GPIO0";
gpio13.GPIO.$suggestSolution            = "GPIO0";
gpio14.GPIO.$suggestSolution            = "GPIO0";
gpio15.GPIO.$suggestSolution            = "GPIO0";
gpio16.GPIO.$suggestSolution            = "GPIO0";
gpio17.GPIO.$suggestSolution            = "GPIO0";
gpio18.GPIO.$suggestSolution            = "GPIO0";
gpio19.GPIO.$suggestSolution            = "GPIO0";
gpio20.GPIO.$suggestSolution            = "GPIO0";
gpio21.GPIO.$suggestSolution            = "GPIO0";
gpio22.GPIO.$suggestSolution            = "GPIO0";
gpio23.GPIO.$suggestSolution            = "GPIO0";
gpio24.GPIO.$suggestSolution            = "GPIO0";
gpio25.GPIO.$suggestSolution            = "GPIO0";
gpio26.GPIO.$suggestSolution            = "GPIO0";
gpio27.GPIO.$suggestSolution            = "GPIO0";
gpio28.GPIO.$suggestSolution            = "GPIO0";
gpio29.GPIO.$suggestSolution            = "GPIO0";
gpio30.GPIO.$suggestSolution            = "GPIO0";
gpio31.GPIO.$suggestSolution            = "GPIO0";
gpio32.GPIO.$suggestSolution            = "GPIO0";
gpio33.GPIO.$suggestSolution            = "GPIO0";
gpio34.GPIO.$suggestSolution            = "GPIO0";
gpio35.GPIO.$suggestSolution            = "GPIO0";
gpio36.GPIO.$suggestSolution            = "GPIO0";
gpio37.GPIO.$suggestSolution            = "GPIO0";
gpio38.GPIO.$suggestSolution            = "GPIO0";
gpio39.GPIO.$suggestSolution            = "GPIO0";
gpio40.GPIO.$suggestSolution            = "GPIO0";
gpio41.GPIO.$suggestSolution            = "GPIO0";
gpio42.GPIO.$suggestSolution            = "GPIO0";
gpio43.GPIO.$suggestSolution            = "GPIO0";
gpio44.GPIO.$suggestSolution            = "GPIO0";
gpio45.GPIO.$suggestSolution            = "GPIO0";
gpio46.GPIO.$suggestSolution            = "GPIO0";
gpio47.GPIO.$suggestSolution            = "GPIO0";
gpio48.GPIO.$suggestSolution            = "GPIO0";
gpio49.GPIO.$suggestSolution            = "GPIO0";
gpio50.GPIO.$suggestSolution            = "GPIO0";
gpio51.GPIO.$suggestSolution            = "GPIO0";
gpio52.GPIO.$suggestSolution            = "GPIO0";
gpio53.GPIO.$suggestSolution            = "GPIO0";
gpio54.GPIO.$suggestSolution            = "GPIO0";
gpio55.GPIO.$suggestSolution            = "GPIO0";
gpio56.GPIO.$suggestSolution            = "GPIO0";
gpio57.GPIO.$suggestSolution            = "GPIO0";
gpio58.GPIO.$suggestSolution            = "GPIO0";
gpio60.GPIO.$suggestSolution            = "GPIO0";
gpio61.GPIO.$suggestSolution            = "GPIO0";
debug_log.uartLog.UART.$suggestSolution = "UART0";
